data/oforg_channel2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 22.4;
    }

    top
    {
        type zeroGradient;
    }

    right
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
